In [22]:
import numpy as np
import pandas as pd

In [23]:
data_frame1 ={
    'Name' : ["Raj","Vijay","Rahul",np.nan],
    'Age'  : [19,20,21,18],
    'Class': [12,np.nan,12,np.nan],
    'State': ["Rajasthan","Gujrat","Rajasthan","Tamil nadu"]
}
df1 = pd.DataFrame(data_frame1)
df1

    Name  Age  Class       State
0    Raj   19   12.0   Rajasthan
1  Vijay   20    NaN      Gujrat
2  Rahul   21   12.0   Rajasthan
3    NaN   18    NaN  Tamil nadu

### FINDING MISSING DATA

In [24]:
#check it's null or not
df1.isna()

    Name    Age  Class  State
0  False  False  False  False
1  False  False   True  False
2  False  False  False  False
3   True  False   True  False

In [25]:
#count how many values are missing
df1.isna().sum()

Name     1
Age      0
Class    2
State    0
dtype: int64

In [26]:
#check wheather null values exit or not in column
df1.isna().any()

Name      True
Age      False
Class     True
State    False
dtype: bool

### DELETE MISSING DATA
#dropna() can't delete row permanently
#for do permanently we use inplace = TRUE
#perform row wise

In [27]:
#drop all the row which contain null value
df1.dropna()

    Name  Age  Class      State
0    Raj   19   12.0  Rajasthan
2  Rahul   21   12.0  Rajasthan

In [28]:
#return row which contain atleast 3 non-null value
df1.dropna(thresh=3)

    Name  Age  Class      State
0    Raj   19   12.0  Rajasthan
1  Vijay   20    NaN     Gujrat
2  Rahul   21   12.0  Rajasthan

### FILLING DATA
#perform column wise

In [29]:
df1.fillna(0)

    Name  Age  Class       State
0    Raj   19   12.0   Rajasthan
1  Vijay   20    0.0      Gujrat
2  Rahul   21   12.0   Rajasthan
3      0   18    0.0  Tamil nadu

In [30]:
values = {'Name':"user",'Age':18,'Class':11,'State':"not mention"}
df1.fillna(value=values)

    Name  Age  Class       State
0    Raj   19   12.0   Rajasthan
1  Vijay   20   11.0      Gujrat
2  Rahul   21   12.0   Rajasthan
3   user   18   11.0  Tamil nadu

In [31]:
# creating new data frame for mean  beacuse it take only int not str
data_frame2 = [
    [1,18,12,76],
    [2,17,11,89],
    [3,19,12,92],
    [4,18,11,97]
               ]
df2 = pd.DataFrame(data_frame2)
df2.fillna(df2.mean())

   0   1   2   3
0  1  18  12  76
1  2  17  11  89
2  3  19  12  92
3  4  18  11  97